// Generated by jextract

package com.github.auties00.cobalt.call.internal.video.h264.bindings;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct TagEncParamExt {
 *     EUsageType iUsageType;
 *     int iPicWidth;
 *     int iPicHeight;
 *     int iTargetBitrate;
 *     RC_MODES iRCMode;
 *     float fMaxFrameRate;
 *     int iTemporalLayerNum;
 *     int iSpatialLayerNum;
 *     SSpatialLayerConfig sSpatialLayers[4];
 *     ECOMPLEXITY_MODE iComplexityMode;
 *     unsigned int uiIntraPeriod;
 *     int iNumRefFrame;
 *     EParameterSetStrategy eSpsPpsIdStrategy;
 *     bool bPrefixNalAddingCtrl;
 *     bool bEnableSSEI;
 *     bool bSimulcastAVC;
 *     int iPaddingFlag;
 *     int iEntropyCodingModeFlag;
 *     bool bEnableFrameSkip;
 *     int iMaxBitrate;
 *     int iMaxQp;
 *     int iMinQp;
 *     unsigned int uiMaxNalSize;
 *     bool bEnableLongTermReference;
 *     int iLTRRefNum;
 *     unsigned int iLtrMarkPeriod;
 *     unsigned short iMultipleThreadIdc;
 *     bool bUseLoadBalancing;
 *     int iLoopFilterDisableIdc;
 *     int iLoopFilterAlphaC0Offset;
 *     int iLoopFilterBetaOffset;
 *     bool bEnableDenoise;
 *     bool bEnableBackgroundDetection;
 *     bool bEnableAdaptiveQuant;
 *     bool bEnableFrameCroppingFlag;
 *     bool bEnableSceneChangeDetect;
 *     bool bIsLosslessLink;
 *     bool bFixRCOverShoot;
 *     int iIdrBitrateRatio;
 * }
 * }
 */
public class TagEncParamExt {

    TagEncParamExt() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        OpenH264.C_INT.withName("iUsageType"),
        OpenH264.C_INT.withName("iPicWidth"),
        OpenH264.C_INT.withName("iPicHeight"),
        OpenH264.C_INT.withName("iTargetBitrate"),
        OpenH264.C_INT.withName("iRCMode"),
        OpenH264.C_FLOAT.withName("fMaxFrameRate"),
        OpenH264.C_INT.withName("iTemporalLayerNum"),
        OpenH264.C_INT.withName("iSpatialLayerNum"),
        MemoryLayout.sequenceLayout(4, SSpatialLayerConfig.layout()).withName("sSpatialLayers"),
        OpenH264.C_INT.withName("iComplexityMode"),
        OpenH264.C_INT.withName("uiIntraPeriod"),
        OpenH264.C_INT.withName("iNumRefFrame"),
        OpenH264.C_INT.withName("eSpsPpsIdStrategy"),
        OpenH264.C_BOOL.withName("bPrefixNalAddingCtrl"),
        OpenH264.C_BOOL.withName("bEnableSSEI"),
        OpenH264.C_BOOL.withName("bSimulcastAVC"),
        MemoryLayout.paddingLayout(1),
        OpenH264.C_INT.withName("iPaddingFlag"),
        OpenH264.C_INT.withName("iEntropyCodingModeFlag"),
        OpenH264.C_BOOL.withName("bEnableFrameSkip"),
        MemoryLayout.paddingLayout(3),
        OpenH264.C_INT.withName("iMaxBitrate"),
        OpenH264.C_INT.withName("iMaxQp"),
        OpenH264.C_INT.withName("iMinQp"),
        OpenH264.C_INT.withName("uiMaxNalSize"),
        OpenH264.C_BOOL.withName("bEnableLongTermReference"),
        MemoryLayout.paddingLayout(3),
        OpenH264.C_INT.withName("iLTRRefNum"),
        OpenH264.C_INT.withName("iLtrMarkPeriod"),
        OpenH264.C_SHORT.withName("iMultipleThreadIdc"),
        OpenH264.C_BOOL.withName("bUseLoadBalancing"),
        MemoryLayout.paddingLayout(1),
        OpenH264.C_INT.withName("iLoopFilterDisableIdc"),
        OpenH264.C_INT.withName("iLoopFilterAlphaC0Offset"),
        OpenH264.C_INT.withName("iLoopFilterBetaOffset"),
        OpenH264.C_BOOL.withName("bEnableDenoise"),
        OpenH264.C_BOOL.withName("bEnableBackgroundDetection"),
        OpenH264.C_BOOL.withName("bEnableAdaptiveQuant"),
        OpenH264.C_BOOL.withName("bEnableFrameCroppingFlag"),
        OpenH264.C_BOOL.withName("bEnableSceneChangeDetect"),
        OpenH264.C_BOOL.withName("bIsLosslessLink"),
        OpenH264.C_BOOL.withName("bFixRCOverShoot"),
        MemoryLayout.paddingLayout(1),
        OpenH264.C_INT.withName("iIdrBitrateRatio")
    ).withName("TagEncParamExt");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt iUsageType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("iUsageType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * EUsageType iUsageType
     * }
     */
    public static final OfInt iUsageType$layout() {
        return iUsageType$LAYOUT;
    }

    private static final long iUsageType$OFFSET = $LAYOUT.byteOffset(groupElement("iUsageType"));

    /**
     * Offset for field:
     * {@snippet lang=c :
     * EUsageType iUsageType
     * }
     */
    public static final long iUsageType$offset() {
        return iUsageType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * EUsageType iUsageType
     * }
     */
